const termsContent1 = `
①회원은 언제든지 서면, e-mail, 전화, 기타 당사가 정하는 방법으로 회원탈퇴를 요청할 수 있으며, 당사와 제휴사는 다음 제1)호의 경우 또는 본 조 제②항 경우를 제외하고는 회원의 요청에 따라 조속히 회원탈퇴에 필요한 제반 절차를 수행합니다. 단, 회원탈퇴 시 이벤트 부정 이용 방지 등을 위하여 탈퇴일로부터 30일 이내에 재가입이 불가하나, 동 기간 중 제휴카드를 발급하는 경우에는 회원탈퇴가 자동 취소되며 정상적으로 CJ ONE 서비스 이용이 가능합니다.
1) 당사나 제휴사를 통해 구매하거나 예약한 물품/서비스가 배송 중이거나 실현되지 아니한 때
②포인트 사용 후 사용 된 포인트의 적립 원천이 되는 구매 행위의 취소로 인해 마이너스 포인트가 발생한 회원은 별도 당사 난 제휴사의 승인이나 해당 포인트에 해당하는 금액을 변제하기 전까지는 탈퇴가 불가합니다.
③유상으로 충전된 포인트가 남아있는 경우 유상 충전 포인트를 모두 인출한 후 탈퇴가 가능합니다.
④회원이 다음 각 호에 해당하는 경우, 당사는 당해 회원에 사전고지 후(다만, 불가피한 경우 사후에 통지 합니다) 회원 자격을 상실시킬 수 있습니다.
1) 회원 가입 신청 시, 허위 내용을 등록하거나 타인의 명의를 도용한 경우
2) 회원이 부정적립, 부정사용 등 CJ ONE 포인트 및 CJ ONE 카드를 부정한 방법 또는 목적으로 이용한 경우
- 부정적립 : 회원이 실제로 상품이나 서비스를 구매하지 않았음에도 불구하고 당해 회원에게 포인트가 적립된 경우를 말합니다. 그러나 시스템의 오류 등 회원의 귀책사유에 의하지 않고 포인트가 적립된 경우나 당해 제휴영업점에게 상품이나 서비스를 실제로 구매한 당사자의 동의가 있어 구매 당사자 대신 다른 회원에게 포인트를 적립하는 경우는 이에 제외됩니다. 단, 제휴영업점주 및 그 피고용인인 회원의 경우에는 당해 제휴영업점에서 상품이나 서비스를 실제로 구매한 당사자의 동의가 있는 경우에도 회원이 실제로 상품이나 서비스를 구입하지 않는 한, 이에 따른 포인트 적립은 부정 적립에 해당됩니다.
- 부정적립된 포인트는 회원 자격 상실 통보와 함께 동시 소멸하고 이에 대하여 회원은 어떠한 권리도 주장할 수 없습니다. 또한 부정적립 포인트로 상품이나 서비스를 구매하는 등의 부당이득이 발생한 경우 회원 당사자 또는 부정적립 동조자가 당사 또는 제휴사에 대한 민·형사상 책임을 집니다.
- 부정사용 : 당사나 제휴사 또는 회원의 동의 없이 타 회원의 포인트를 수단과 방법에 관계 없이 임의로 사용한 경우를 말합니다.
3) 다른 회원의 정보를 도용하여 당사나 제휴사 및 제휴영업점의 서비스홈페이지 이용을 부당하게 방해하는 등 관련 법령을 위반하는 경우
4) 포인트 사용 후 사용된 포인트의 적립 원천이 되는 구매 행위의 취소를 상습적으로(2회 이상) 반복해 당사나 해당 제휴사에 피해를 끼치는 경우
5) 당사나 제휴사 서비스홈페이지를 이용하여 법령 및 이 약관에서 금지하는 행위를 하는 경우
6) 기타 본 약관이 규정하는 회원의 의무를 위반하는 경우
7) 회원이 당사가 인정하지 아니하는 방법 혹은 부정하게 타인의 아이디를 이용하여 포인트 등을 취득 또는 사용하는 경우
8) 회원이 악의적으로 마이너스(-) 포인트를 발생시킨 것으로 판단되는 경우
⑤본 조 제④항에 의해 회원 자격이 상실된 회원은 당사로부터 해당 사유발생에 대한 통지를 받은 날로부터 최대 30일 이내에 본인의 의견을 소명할 수 있으며, 당사는 회원의 소명 내용을 심사하여 회원의 주장이 타당하다고 판단하는 경우 회원으로 하여금 계속하여 정상적인 CJ ONE 서비스를 이용할 수 있도록 합니다.
⑥본 조 제①항에 의한 회원탈퇴 또는 제④항에 의한 회원자격상실이 확정되는 시점은 아래와 같습니다.
1) 회원의 탈퇴요청의 경우에는 당사가 회원탈퇴 처리의 완료 통보하는 시점에서 탈퇴가 완료 됩니다. 다만, 당사는 완료 통보일로부터 30일의 유예 기간 동안 기 적립된 포인트 정보를 소멸시키지 아니하고 저장하였다가, 회원이 별도의 절차를 거쳐 재가입 요청을 하고 회사가 이를 허락하여 유예 기간 내 재가입할 경우, 모든 포인트를 재사용토록 하며, 재가입이 없이 유예기간이 지나면, 모든 포인트가 즉시 소멸됩니다.
2) 회원자격상실의 경우 통보일에 회원 자격상실이 확정됩니다.
⑦본 조 제①항에 의한 회원탈퇴 또는 제④항에 의한 회원자격상실이 된 경우 회원 정보는 다음과 같이 처리 됩니다.
1) 탈퇴한 회원의 정보는 본 약관 제21조에 규정하는 바에 따라 일정 기간 보유 후 삭제처리 됩니다.
2) 회원 자격이 상실 된 회원의 정보는 회원 자격상실 확정 후 CJ ONE 서비스 부정 이용 방지 및 타 회원의 추가적인 피해 방지를 위해 2년간 보유 하며 이 기간 동안 재가입 및 CJ ONE 서비스가 불가 할 수도 있습니다.
            `;


const termsContent2 = `① '회사'와 상품 등의 구매에 관한 계약을 체결한 이용자는 상품배송이 완료된 날로부터 7일 이내에 청약을 철회할 수 있습니다.

② 구매자는 상품을 배송 받은 경우 다음 각호의 1에 해당하는 경우에는 반품 및 교환을 할 수 없습니다.

가. 구매자에게 책임 있는 사유로 상품이 멸실 또는 훼손된 경우

(다만, 상품의 내용 확인을 위하여 포장 등을 훼손한 경우에는 청약철회를 할 수 있습니다.)

나. 구매자의 사용 또는 일부 소비에 의하여 상품의 가치가 현저히 감소한 경우

다. 시간의 경과에 의하여 재판매가 곤란할 정도로 상품의 가치가 현저히 감소한 경우

라. 같은 성능을 지닌 상품으로 복제가 가능한 경우 그 원본인 상품의 포장을 훼손한 경우

마. 그 밖에 거래의 안전을 위하여 전자상거래 등에서의 소비자보호에 관한 법률 시행령 21조(청약철회 등의 제한)에서 정하는 경우

③ 제2항 제2호 내지 제4호의 경우에 '회사'가 사전에 청약철회 등이 제한되는 사실을 소비자가 쉽게 알 수 있는 곳에 명기하거나 시용상품을 제공하는 등의 조치를 하지 않았다면 이용자의 청약철회 등이 제한되지 않습니다.

④ 이용자는 제1항 및 제2항의 규정에 불구하고 상품의 내용이 표시ㆍ광고 내용과 다르거나, 계약내용과 다르게 이행된 경우에는 당해 상품을 공급받은 날로부터 3월 이내, 그 사실을 안 날 또는 알 수 있었던 날로부터 30일 이내에 청약철회 등을 할 수 있습니다.
            `;

const termsContent3=`① 본 약관은 주식회사 이벤터스(이하 ‘회사’라 합니다)가 제공하는 전자지급결제대행서비스, 선불전자지급수단의 발행 및 관리서비스(이하 ‘전자금융거래서비스’라 합니다)를 취소/환불함에 있어, 회사와 회원간 권리, 의무 및 회원의 이용절차 등에 관한 사항을 규정하는 것을 그 목적으로 합니다.

② 회사는 통신판매중개자이며 개설된 행사의 주최 및 당사자가 아닙니다.

③ 회사가 제공하는 결제서비스를 이용한 유료행사는 결제금액의 환불 시 회사가 정한 취소/환불약관에 따릅니다.

④ 호스트 통장입금 방식, 외부/현장신청 방식을 통한 결제금액의 환불은 본 약관의 적용대상에 해당하지 않습니다.
            `;
            
export { termsContent1, termsContent2, termsContent3 };
